### Forest: forest-calibnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
local_sensitive_file.bootstrap_script: Refreshing state... [id=05ecc25153fb5e440787400596c41ada9009605a]
data.digitalocean_ssh_keys.keys: Reading...
data.digitalocean_project.forest_project: Reading...
data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/8656000852680004208]
digitalocean_droplet.forest: Refreshing state... [id=402459791]
digitalocean_firewall.forest_firewall: Refreshing state... [id=7ce2f9f4-6cc3-4030-b4b7-5605f3119163]
data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
        id              = "7ce2f9f4-6cc3-4030-b4b7-5605f3119163"
        name            = "prod-forest-calibnet-firewall"
        tags            = []
        # (4 unchanged attributes hidden)

      - inbound_rule {
          - port_range                = "1234" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - source_droplet_ids        = [] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }
      - inbound_rule {
          - port_range                = "34000" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - source_droplet_ids        = [] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }
      - inbound_rule {
          - port_range                = "all" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - source_droplet_ids        = [] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }
      + inbound_rule {
          + port_range                = "12345"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "2345"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "6116"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - protocol                       = "icmp" -> null
        }
      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - port_range                     = "34000" -> null
          - protocol                       = "tcp" -> null
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + protocol                       = "icmp"
        }

        # (5 unchanged blocks hidden)
    }

  # local_sensitive_file.bootstrap_script will be created
  + resource "local_sensitive_file" "bootstrap_script" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "bootstrap.bash"
      + id                   = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/forest-iac/forest-iac/tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/forest-iac/forest-iac/tfplan"
```

</details>